<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="author" content="Marc Gloor">
   <meta name="GENERATOR" content="Mozilla/4.76 [en] (X11; U; Linux 2.2.16 i686) [Netscape]">
   <title>Standard Library unter Linux</title>
</head>
<body text="#000000" bgcolor="#FFFFFF" link="#0000EF" vlink="#51188E" alink="#FF0000">
<b><font size=+1>glibc Crashkurs</font></b>
<br>von Marc Gloor
<br>
<hr WIDTH="100%">
<p>Im t&auml;glichen Umgang mit Linux stellt sich immer wieder die Frage,
welche Standard-library denn nun wo installiert ist und wie man Problemen
am besten aus dem Weg geht. Im Folgenden habe ich meine Erfahrungen und
Recherchen f&uuml;r Linux Einsteiger hoffentlich leicht verst&auml;ndlich
in einem quick-and-dirty crashkurs zusammengefasst:
<p>Die Standard Library unter Linux stellt alle standard C Befehle (wie
z.bsp. printf, read, open) zur Verf&uuml;gung (auch bekannt als Syscalls).
GNU libc v1 war bis 1997 die einzige verf&uuml;gbare Library f&uuml;r Linux
(/lib/libc.so.5). Im selben Jahr entwickelte die Free Software Foundation
die GNU libc v2 mit dem Ziel eine sauber programmierte, portable und POSIX-konforme
library zur Verf&uuml;gung zu stellen.
<p>Unter Linux erhielt diese neue Library die Hauptversionsnummer 6, seither
wird sie libc6 oder glibc2 genannt. Die beiden Libraries (libc5 und libc6)
sind zueinander inkompatibel. Wurde ein Programm gegen libc5 gelinkt, konnte
man es nicht auf einem libc6 System ausf&uuml;hren. Die meisten Distributionen
haben den Wechsel von libc.so.5 auf libc6 vollzogen (RedHat sein Version
5, Debian seit Version 2, SuSE seit Version 6 und Slackware seit Version
4), was heisst, dass alle binaries der genannten Distributionen gegen die
neue glibc2 gelinkt wurden. Um die Kompatibilit&auml;t mit &auml;lteren
binaries zu gew&auml;hrleisten, verf&uuml;gen die meisten Distributionen
noch &uuml;ber die alte libc5, besonders wichtig bei Programmen die nicht
im Quellcode vorliegen. Es ist zu beachten, dass glibc2 in verschiedenen
Versionen zur Verf&uuml;gung steht, so unterscheidet man zwischen glibc2.0
und glibc2.1 die beiden Versionen sind in diesem Fall inkompatibel, im
Zweifelsfall konsultiert man die Dokumentation um die Kompatibilit&auml;t
zu gew&auml;hrleisten. Welche Version die eigene Distribution verwendet
verr&auml;t der folgende symlink:
<p><tt>root@node6# ls -l /usr/lib/libc.so.6</tt>
<br><tt>lrwxrwxrwx&nbsp; 1 root&nbsp; root&nbsp;&nbsp;&nbsp; 13 Jan 10
22:58 libc.so.6 -> libc-2.1.3.so</tt>
<p>Besonders &auml;rgerlich ist binary-only software die auf eine brandneue
glibc aufsetzt und nicht im Sourcecode verf&uuml;gbar ist. In diesem Fall
sollte man seine Distribution auf die neuste glibc upgraden, mit den Werkzeugen
seiner Distribution wie apt oder yast. Grunds&auml;tzlich sind manuelle
glibc Releasewechsel kritisch weil alle Systemkomponenten davon abh&auml;ngig
sind. Ein manueller glibc upgrade (kompilieren, installieren) sollte nur
von einem Spezialisten durchgef&uuml;hrt werden. Eine allgemeine Faustregel
besagt, dass ein manueller upgrade auf Distributionen die &auml;lter als
ein Jahr alt sind, zu aufwendig ist.
<p>Um sein System nicht zu besch&auml;digen besteht zus&auml;tzlich die
M&ouml;glichkeit, eine auf einer aktuellen glibc basierende chroot-Umgebung
aufzubauen, mit anderen Worten der Aufbau einer unabh&auml;ngigen Linux-Umgebung
innerhalb seines Systems - eine Sandbox. Dies erfordert allerdings gen&uuml;gend
Diskspace und etwas Sachverstand beim Aufbau (Linux Documentation Projekt
bzw. man chroot).
<br>&nbsp;
<p>
<hr WIDTH="100%">
<table BORDER=0 CELLSPACING=0 CELLPADDING=0 COLS=2 WIDTH="100%" NOSAVE >
<tr NOSAVE>  <tbody>
    <tr nosave="">
      <td width="90%" nosave="">
      <pre style="font-family: times new roman,times,serif;"><i>$Id: glibc2.html,v 1.9 2020/11/21 11:13:30 gloor Exp $<br>Author:</i><i> <a href="mailto:marc_dot_gloor_at_u_dot_nus_dot_edu">marc_dot_gloor_at_u_dot_nus_dot_edu</a></i></pre><br>
      <i> </i> <dt>
      </dt>
      </td>
      <td valign="top" nosave="">
      <div align="right"><i><a href="index.html">home</a></i></div>
      </td>
    </tr>
  </tbody>
</table>

</body>
</html>
